app/Http/Controllers/Auth/LoginController.php

    public function __construct(Request $request)
    {

        $request['email'] = str_replace(' ', '', $request['email']);
        $request['password'] = str_replace(' ', '', $request['password']);

        $data = $request->all();
        if(!empty($request['email']) && !empty($request['password'])){

                $user = User::where('email',$data['email'])->first('provider');
                $system_settings = SystemSetting::first();
---
select `provider` from `users` where `email` = 'admin@admin.com' limit 1
select * from `system_settings` limit 1