public/themes/theme6/views/header.php

<head>
    <?php
      $Script     = App\Script::pluck('header_script')->toArray();
      $theme_mode = App\SiteTheme::pluck('theme_mode')->first();
      $theme      = App\SiteTheme::first();

      $signin_header = App\SiteTheme::pluck('signin_header')->first();
---
select `header_script` from `scripts`
select `theme_mode` from `site_themes`
select * from `site_themes` limit 1
select `signin_header` from `site_themes`


    <?php

      $settings = App\Setting::first();

      $dynamic_page = App\Page::where('slug', '=', $request_url)->first();
---
select * from `settings` limit 1
select * from `pages` where `slug` = 'audio_1700576844.webp' limit 1

      $SiteMeta_image = App\SiteMeta::where('page_slug', '=', $request_url)->pluck('meta_image')->first();

      if(!Auth::guest() && Auth::User()->role != 'admin' || Auth::guest()){
         $menus = App\Menu::orderBy('order', 'asc')->where('in_home','!=',0)->orWhere('in_home', '=', null)->get();
---
select * from `menus` where `in_home` != 0 or `in_home` is null order by `order` asc

    <?php if(!empty($settings->website_name)){ ?>
    <meta property="og:site_name" content="<?php echo $settings->website_name ;?>" /><?php } ?>

    <?php  $Linking_Setting = App\LinkingSetting::first();
---
select * from `deep_linking_settings` limit 1


                                 <?php

                                    $video_category = App\VideoCategory::orderBy('order', 'asc')->where('in_menu',1)->get();

                                    $LiveCategory = App\LiveCategory::orderBy('order', 'asc')->get();

                                    $AudioCategory = App\AudioCategory::orderBy('order', 'asc')->get();

                                    $tv_shows_series = App\Series::where('active',1)->get();

                                    $languages = App\Language::all();
---
select * from `video_categories` where `in_menu` = 1 order by `order` asc
select * from `live_categories` order by `order` asc
select * from `audio_categories` order by `order` asc
select * from `series` where `active` = 1
select * from `languages`