public/themes/default/views/footer.blade.php

select * from `app_settings` where `id` = 1 limit 1
---
          <div class="down-apps col-lg-12 d-flex align-items-center justify-content-center">
          <?php $app_settings = App\AppSetting::where('id','=',1)->first(); ?>

select * from `pages` where `footer_active` = 1
---
          <?php
              $cmspages = App\Page::where('footer_active', 1)->get();