public/themes/default/views/footer.blade.php

select * from `settings` limit 1
select * from `users` where `id` = 1 limit 1
select * from `app_settings` where `id` = 1 and `status` = 'hidden' limit 1
select `theme_mode` from `site_themes`
select * from `site_themes` limit 1
---
<?php $settings = App\Setting::first();
       use Carbon\Carbon;
       $user = App\User::where('id','=',1)->first();
       $app_setting = App\AppSetting::where('id','=',1)->where('status','hidden')->first();
       $session = session()->all();
       $theme_mode = App\SiteTheme::pluck('theme_mode')->first();
       $theme = App\SiteTheme::first();

select `footer_script` from `scripts`
---
<?php
      $footer_script = App\Script::pluck('footer_script')->toArray();