public/themes/default/views/header.php

select `theme_mode` from `site_themes`
---
   <?php
      $Script = App\Script::pluck('header_script')->toArray();
      // dd(($Script[2]));
      $theme_mode = App\SiteTheme::pluck('theme_mode')->first();