public/themes/default/views/header.php

<head>
   <?php
      $Script = App\Script::pluck('header_script')->toArray();

      $theme = App\SiteTheme::first();
---
select `header_script` from `scripts`
select * from `site_themes` limit 1

      if(Auth::guest()){
         $geoip = new \Victorybiz\GeoIPLocation\GeoIPLocation();
         $userIp = $geoip->getip();
         $UserTranslation = App\UserTranslation::where('ip_address',$userIp)->first();
---
select * from `user_translations` where `ip_address` = '169.159.82.111' limit 1

                 $translate_language = $GetWebsiteName.@$website_default_language;
             }
         }else if(Auth::user()->id != ''){
             $UserTranslation = App\UserTranslation::where('user_id',Auth::user()->id)->first();
---
select * from `user_translations` where `user_id` = 1 limit 1

      \App::setLocale(@$translate_language);


      $TranslationLanguage = App\TranslationLanguage::where('status',1)->get();
      if(!empty(Auth::User()->id)){

         $id = Auth::User()->id;
         $users = App\User::find($id);
---
select * from `translation_languages` where `status` = 1
select * from `users` where `users`.`id` = 1 limit 1

      ?>

   <?php
      $videos_data = App\Video::where("slug", $request_url)->first();
      $series = App\Series::where("slug", $request_url)->first();
      $episdoe = App\Episode::where("slug", $request_url)->first();
      $livestream = App\LiveStream::where("slug", $request_url)->first();
      $dynamic_page = App\Page::where('slug', '=', $request_url)->first();
---
select * from `videos` where `slug` = '' limit 1
select * from `series` where `slug` = '' limit 1
select * from `episodes` where `slug` = '' limit 1
select * from `live_streams` where `slug` = '' limit 1
select * from `pages` where `slug` = '' limit 1


<?php if(!empty($settings->website_name)){ ?><meta property="og:site_name" content="<?php echo $settings->website_name ;?>" /><?php } ?>

   <?php  $Linking_Setting = App\LinkingSetting::first();
---
select * from `deep_linking_settings` limit 1

                                 </ul>
                              </li>
                              <?php } elseif ( $menu->in_menu == "movies") {
                                 $cat = App\VideoCategory::orderBy('order', 'asc')->get();
---
select * from `live_categories` order by `order` asc
select * from `video_categories` order by `order` asc


                              <!-- Audios dropdown -->
                              <?php }elseif ( $menu->in_menu == "audios") {
                                 $AudioCategory = App\AudioCategory::orderBy('order', 'asc')->get();
---
select * from `live_categories` order by `order` asc