public/themes/default/views/home.php

<!-- Header Start Test MEssage -->
<?php include('header.php');
   $order_settings = App\OrderHomeSetting::select('id','order_id','url','video_name','header_name')->orderBy('order_id', 'asc')->get();
   $order_settings_list = App\OrderHomeSetting::get();
   $continue_watching_setting = App\HomeSetting::pluck('continue_watching')->first();
   $slider_choosen = App\HomeSetting::pluck('slider_choosen')->first();
---
select `id`, `order_id`, `url`, `video_name`, `header_name` from `order_homesettings` order by `order_id` asc
select * from `order_homesettings`
select `continue_watching` from `home_settings`
select `slider_choosen` from `home_settings`

         $Multiuser=Session('subuser_id');
         $Multiprofile= App\Multiprofile::where('id',$Multiuser)->first();

         $parentCategories = App\VideoCategory::where('in_home','=',1)->orderBy('order','ASC')->get();
---
select * from `video_categories` where `in_home` = 1 order by `order` asc

           } } else {


         $videos = App\Video::join('categoryvideos', 'categoryvideos.video_id', '=', 'videos.id')
                              ->where('category_id','=',$category->id)->where('active', '=', '1')
                              ->where('status', '=', '1')
                              ->where('draft', '=', '1');
---
select * from `videos` inner join `categoryvideos` on `categoryvideos`.`video_id` = `videos`.`id` where `category_id` = 1 and `active` = '1' and `status` = '1' and `draft` = '1' order by `videos`.`created_at` desc

         $videos = $videos->latest('videos.created_at')->get();


         $Episode_videos =  App\Series::select('episodes.*','series.title as series_name','series.slug as series_slug')
                  ->join('series_categories', 'series_categories.series_id', '=', 'series.id')
                  ->join('episodes', 'episodes.series_id', '=', 'series.id')
                  ->where('series_categories.category_id','=',$category->id)
                  ->where('episodes.active', '=', '1')
                  ->where('series.active', '=', '1')
                  ->groupBy('episodes.id')
                  ->latest('episodes.created_at')
                  ->get();
---
select `episodes`.*, `series`.`title` as `series_name`, `series`.`slug` as `series_slug` from `series` inner join `series_categories` on `series_categories`.`series_id` = `series`.`id` inner join `episodes` on `episodes`.`series_id` = `series`.`id` where `series_categories`.`category_id` = 1 and `episodes`.`active` = '1' and `series`.`active` = '1' group by `episodes`.`id` order by `episodes`.`created_at` desc