public/themes/default/views/liveCategoryVideos.php

<?php include('header.php');

$order_settings = App\OrderHomeSetting::orderBy('order_id', 'asc')->get();
$order_settings_list = App\OrderHomeSetting::get();

 $parentCategories = App\LiveCategory::get();
---
select * from `order_homesettings` order by `order_id` asc
select * from `order_homesettings`
select * from `live_categories`

              <div class="col-sm-12 overflow-hidden">
              <?php
                        foreach($parentCategories as $category) {
                        $live_videos = App\LiveStream::join('livecategories', 'livecategories.live_id', '=', 'live_streams.id')
                        ->where('livecategories.category_id','=',$category->id)
                        ->where('active', '=', '1')->get();
---
select * from `live_streams` inner join `livecategories` on `livecategories`.`live_id` = `live_streams`.`id` where `livecategories`.`category_id` = 1 and `active` = '1'