public/themes/theme3/partials/Search_content.php


    $latest_videos = $latest_videos->get();

    $latest_livestreams =  App\LiveStream::limit('5')->latest()->get();

    $latest_audio =  App\Audio::where('active', '=', '1')->where('status', '=', '1')
                                ->limit('5')->latest()->get();

    $latest_Episode = App\Episode::where('active', '=', '1')->where('status', '=', '1')
                                ->limit('5')->latest()->get();

    $latest_Series = App\Series::where('active', '=', '1')->limit('5')->latest()->get();
---
select * from `live_streams` order by `created_at` desc limit 5
select * from `audio` where `active` = '1' and `status` = '1' order by `created_at` desc limit 5
select * from `episodes` where `active` = '1' and `status` = '1' order by `created_at` desc limit 5
select * from `series` where `active` = '1' order by `created_at` desc limit 5

                $Most_view_videos = $Most_view_videos->get();


    $Most_view_audios = App\RecentView::Join('audio','audio.id','=','recent_views.audio_id')
        ->where('audio.active', '=', '1')
        ->where('audio.status', '=', '1')
        ->limit('5')
        ->latest('audio.created_at')
        ->groupBy('audio_id')
        ->get();

    $Most_view_live   = App\RecentView::Join('live_streams','live_streams.id','=','recent_views.live_id')
        ->where('live_streams.active', '=', '1')
        ->latest('live_streams.created_at')
        ->groupBy('recent_views.live_id')
        ->limit('5')
        ->get();

    $Most_view_episode  = App\RecentView::Join('episodes','episodes.id','=','recent_views.episode_id')
        ->where('episodes.active', '=', '1')
        ->where('episodes.status', '=', '1')
        ->limit('5')
        ->latest('episodes.created_at')
        ->groupBy('episode_id')
        ->get();

    $Most_view_Series  = App\RecentView::select('series.*')
        ->Join('episodes','episodes.id','=','recent_views.episode_id')
        ->Join('series','series.id','=','episodes.series_id')
        ->where('series.active', '=', '1')
        ->limit('5')
        ->latest('series.created_at')
        ->groupBy('series.id')
        ->get();
---
select * from `recent_views` inner join `audio` on `audio`.`id` = `recent_views`.`audio_id` where `audio`.`active` = '1' and `audio`.`status` = '1' group by `audio_id` order by `audio`.`created_at` desc limit 5
select * from `recent_views` inner join `live_streams` on `live_streams`.`id` = `recent_views`.`live_id` where `live_streams`.`active` = '1' group by `recent_views`.`live_id` order by `live_streams`.`created_at` desc limit 5
select * from `recent_views` inner join `episodes` on `episodes`.`id` = `recent_views`.`episode_id` where `episodes`.`active` = '1' and `episodes`.`status` = '1' group by `episode_id` order by `episodes`.`created_at` desc limit 5
select `series`.* from `recent_views` inner join `episodes` on `episodes`.`id` = `recent_views`.`episode_id` inner join `series` on `series`.`id` = `episodes`.`series_id` where `series`.`active` = '1' group by `series`.`id` order by `series`.`created_at` desc limit 5

                }
    $videos = $videos->get();

    $livestreams = App\LiveStream::where('active', '=', '1')
                    ->where('featured','=', '1')
                    ->limit('5')
                    ->latest()
                    ->get();

    $audio = App\Audio::where('active', '=', '1')
        ->where('status', '=', '1')
        ->where('featured', '=', '1')
        ->limit('5')
        ->latest()
        ->get();

    $Episode = App\Episode::where('active', '=', '1')
        ->where('status', '=', '1')
        ->where('featured', '=', '1')
        ->limit('5')
        ->latest()
        ->get();

    $Series = App\Series::where('active', '=', '1')
        ->where('featured', '=', '1')
        ->limit('5')
        ->latest()
        ->get();
---
select * from `live_streams` where `active` = '1' and `featured` = '1' order by `created_at` desc limit 5
select * from `audio` where `active` = '1' and `status` = '1' and `featured` = '1' order by `created_at` desc limit 5
select * from `episodes` where `active` = '1' and `status` = '1' and `featured` = '1' order by `created_at` desc limit 5
select * from `series` where `active` = '1' and `featured` = '1' order by `created_at` desc limit 5



    <?php foreach ($latest_Episode as $row) {
         $series_slug = App\Series::where('id',$row->series_id)->pluck('slug')->first();
---
select `slug` from `series` where `id` = 7



    <?php foreach ($Most_view_episode as $row) {
         $series_slug = App\Series::where('id',$row->series_id)->pluck('slug')->first();
---
select `slug` from `series` where `id` = 7



    <?php foreach ($Episode as $row) {
         $series_slug = App\Series::where('id',$row->series_id)->pluck('slug')->first();
---
select `slug` from `series` where `id` = 3