public/themes/theme4/views/header.php

<head>
    <?php
      $Script     = App\Script::pluck('header_script')->toArray();
      $theme      = App\SiteTheme::first();
---
select `header_script` from `scripts`
select * from `site_themes` limit 1

      if(!empty(Auth::User()->id)){

         $id = Auth::User()->id;
         $users = App\User::find($id);
---
select * from `users` where `users`.`id` = 1 limit 1


    <?php

      $settings = App\Setting::first();

      $dynamic_page = App\Page::where('slug', '=', $request_url)->first();
---
select * from `settings` limit 1
select * from `pages` where `slug` = '' limit 1

    <?php if(!empty($settings->website_name)){ ?>
    <meta property="og:site_name" content="<?php echo $settings->website_name ;?>" /><?php } ?>

    <?php  $Linking_Setting = App\LinkingSetting::first();
---
select * from `deep_linking_settings` limit 1

                              <div class="d-flex p-2">
                                 <?php if (!Auth::guest()) {
                                    $userEmail = Auth::user()->email;
                                    $moderatorsUser = App\ModeratorsUser::where('email', $userEmail)->first();
                                    $channel = App\Channel::where('email', $userEmail)->first();
---
select * from `moderators_users` where `email` = 'admin@admin.com' limit 1
select * from `channels` where `email` = 'admin@admin.com' limit 1


   <?php

   $playerui_settings = App\Playerui::first();
---
select * from `playerui` limit 1