public/themes/theme1/views/footer.blade.php

<?php $settings = App\Setting::first();
 $user = App\User::where('id','=',1)->first();
 $app_setting = App\AppSetting::where('id','=',1)->where('status','hidden')->first();
---
select * from `settings` limit 1
select * from `users` where `id` = 1 limit 1
select * from `app_settings` where `id` = 1 and `status` = 'hidden' limit 1


                      <?php $column2_footer = App\FooterLink::where('column_position',2)->orderBy('order')->get();
---
select * from `footer_links` where `column_position` = 2 order by `order` asc


                            $column3_footer = App\FooterLink::where('column_position',3)->whereNotIn('link', ['/cpp/signup','/advertiser/register','/channel/register'])
                                            ->orderBy('order')->get();
---
select * from `footer_links` where `column_position` = 3 and `link` not in ('/cpp/signup', '/advertiser/register', '/channel/register') order by `order` asc

                </div>
                <?php $app_settings = App\AppSetting::where('id','=',1)->first();  ?>
---
select * from `app_settings` where `id` = 1 limit 1

                  </div>
                  <?php $video_category = App\VideoCategory::where('footer',1)->get(); ?>
---
select * from `video_categories` where `footer` = 1

						<?php
                        $pages = App\Page::all();
---
select * from `pages`

      <?php
      $footer_script = App\Script::pluck('footer_script')->toArray();
---
select `footer_script` from `scripts`