public/themes/theme1/views/header.php

select `theme_mode` from `site_themes`
select * from `site_themes` limit 1
---

    <?php
    $data = Session::all();
    $theme_mode = App\SiteTheme::pluck('theme_mode')->first();
    $theme = App\SiteTheme::first();

select `translate_checkout` from `site_themes`
select `translate_language` from `settings`
---
    }


    $translate_checkout = App\SiteTheme::pluck('translate_checkout')->first();

    @$translate_language = App\Setting::pluck('translate_language')->first();

select * from `user_translations` where `ip_address` = '169.159.82.111' limit 1
---
    if (Auth::guest()) {
        $geoip = new \Victorybiz\GeoIPLocation\GeoIPLocation();
        $userIp = $geoip->getip();
        $UserTranslation = App\UserTranslation::where('ip_address', $userIp)->first();

select * from `user_translations` where `user_id` = 1 limit 1
---
                $translate_language = GetWebsiteName() . 'en';
            }
        } else if (Auth::user()->id != '') {
            $UserTranslation = App\UserTranslation::where('user_id', Auth::user()->id)->first();

select * from `translation_languages` where `status` = 1
select * from `users` where `users`.`id` = 1 limit 1
---
    \App::setLocale(@$translate_language);


    $TranslationLanguage = App\TranslationLanguage::where('status', 1)->get();
    if (!empty(Auth::User()->id)) {
        $id = Auth::User()->id;
        $users = App\User::find($id);

select * from `settings` limit 1
select * from `videos` where `slug` = 'home' limit 1
select * from `series` where `slug` = 'home' limit 1
select * from `episodes` where `slug` = 'home' limit 1
select * from `live_streams` where `slug` = 'home' limit 1
---
    $data = Session::all();

    ?>
    <!-- Required meta tags -->
    <?php $settings = App\Setting::first(); //echo $settings->website_name;  ?>


    <?php if (!empty($data['password_hash'])) {
        $videos_data = App\Video::where('slug', $request_url)->first();
    } //echo $settings->website_name;  ?>
    <?php if (!empty($data['password_hash'])) {
        $series = App\Series::where('slug', $request_url)->first();
    } //echo $settings->website_name;  ?>
    <?php if (!empty($data['password_hash'])) {
        $episdoe = App\Episode::where('slug', $request_url)->first();
    } //echo $settings->website_name;  ?>
    <?php if (!empty($data['password_hash'])) {
        $livestream = App\LiveStream::where('slug', $request_url)->first();

select * from `series` where `title` = 'home' limit 1
select * from `episodes` where `title` = 'home' limit 1
select * from `pages` where `slug` = 'home' limit 1
---

    <?php
    $videos_data = App\Video::where('slug', $request_url)->first();
    $series = App\Series::where('title', $request_url)->first();
    $episdoe = App\Episode::where('title', $request_url)->first();
    $livestream = App\LiveStream::where('slug', $request_url)->first();
    ?>
    <?php $dynamic_page = App\Page::where('slug', '=', $request_url)->first(); ?>

select * from `deep_linking_settings` limit 1
---
    }
    ?>" />

    <?php $Linking_Setting = App\LinkingSetting::first();

select `header_script` from `scripts`
---
    <script src="https://cdnjs.cloudflare.com/ajax/libs/jquery.lazyload/1.9.1/jquery.lazyload.js"></script>

    <?php
    $Script = App\Script::pluck('header_script')->toArray();

select * from `menus` where `in_home` != 0 or `in_home` is null order by `order` asc
select * from `menus` order by `order` asc
select * from `languages`
select * from `video_categories` where `in_home` = 1 order by `order` asc
---
                                        <?php
                                        $stripe_plan = SubscriptionPlan();
                                        if (!Auth::guest() && Auth::User()->role != 'admin' || Auth::guest()) {
                                            $menus = App\Menu::orderBy('order', 'asc')->where('in_home', '!=', 0)->orWhere('in_home', '=', null)->get();
                                        } else {
                                            $menus = App\Menu::orderBy('order', 'asc')->get();
                                        }
                                        $languages = App\Language::all();
                                        foreach ($menus as $menu) {
                                            if ($menu->in_menu == "video") {
                                                $cat = App\VideoCategory::orderBy("order")->where('in_home', 1)->get();

select * from `video_categories` order by `order` asc
---

                                                </li>
                                            <?php } elseif ($menu->in_menu == "movies") {
                                                $cat = App\VideoCategory::orderBy('order', 'asc')->get();

select * from `live_categories` order by `order` asc
---
                                                </li>
                                            <?php } elseif ($menu->in_menu == "live") {
                                                //  $LiveCategory = App\LiveCategory::all();
                                                $LiveCategory = App\LiveCategory::orderBy('order', 'asc')->get();

select * from `series`
---
                                                <!-- Tv show dropdown -->

                                            <?php } elseif ($menu->in_menu == "tv_show") {
                                                $tv_shows_series = App\Series::get();

select * from `moderators_users` where `email` = 'admin@admin.com' limit 1
select * from `channels` where `email` = 'admin@admin.com' limit 1
---
                            </div>
                            <?php
                            if (!Auth::guest()) {
                                $ModeratorsUser = App\ModeratorsUser::where('email', Auth::User()->email)->first();
                                $Channel = App\Channel::where('email', Auth::User()->email)->first();

select * from `playerui` limit 1
---
        </div>

        <?php
        $playerui_settings = App\Playerui::first();