public/themes/theme1/views/home.php

<!-- Header Start -->
<?php include('header.php');

$order_settings = App\OrderHomeSetting::orderBy('order_id', 'asc')->get();
$order_settings_list = App\OrderHomeSetting::get();
$continue_watching_setting = App\HomeSetting::pluck('continue_watching')->first();
$slider_choosen = App\HomeSetting::pluck('slider_choosen')->first();
---
select * from `order_homesettings` order by `order_id` asc
select * from `order_homesettings`
select `continue_watching` from `home_settings`
select `slider_choosen` from `home_settings`