public/themes/default/views/partials/home/home_pop_up.php

<?php
    $AdminHomePopup  = App\AdminHomePopup::first();
    $enable_popup    = App\AdminHomePopup::pluck('popup_enable')->first();
    $auth_user_role  = Auth::user() ? Auth::user()->role : "guest";
    $auth_guest_user = Auth::guest();
    $guest_user_redirection =  App\AdminHomePopup::pluck('before_login_link')->first() ? '/'.App\AdminHomePopup::pluck('before_login_link')->first() : "/signup";
    $auth_user_redirection  =  App\AdminHomePopup::pluck('after_login_link')->first()  ? '/'.App\AdminHomePopup::pluck('after_login_link')->first() : "/becomesubscriber" ;
---
select * from `admin_home_popups` limit 1
select `popup_enable` from `admin_home_popups`
select `before_login_link` from `admin_home_popups`
select `after_login_link` from `admin_home_popups`