public/themes/default/views/partials/home/latest-videos.php

                                <div class="movie-time d-flex align-items-center pt-1">
                                       <!-- Category Thumbnail  setting -->
                                      <?php
                                      $CategoryThumbnail_setting =  App\CategoryVideo::join('video_categories','video_categories.id','=','categoryvideos.category_id')
                                                  ->where('categoryvideos.video_id',$watchlater_video->id)
                                                  ->pluck('video_categories.name');
---
select `video_categories`.`name` from `categoryvideos` inner join `video_categories` on `video_categories`.`id` = `categoryvideos`.`category_id` where `categoryvideos`.`video_id` = 6