public/themes/default/views/partials/home/live-videos.php

select `live_categories`.`name` from `live_categories` inner join `livecategories` on `livecategories`.`category_id` = `live_categories`.`id` where `livecategories`.`live_id` = 4
---
                                <div class="movie-time d-flex align-items-center my-2">
                                       <!-- Category Thumbnail  setting -->
                                      <?php
                                      $CategoryThumbnail_setting =  App\LiveCategory::join('livecategories','livecategories.category_id','=','live_categories.id')
                                                  ->where('livecategories.live_id',$video->id)
                                                  ->pluck('live_categories.name');