public/themes/default/views/partials/home/livecategory-videos.php


<?php

$setting= \App\HomeSetting::first();
// dd($live_videos);
$currency = App\CurrencySetting::first();
---
select * from `home_settings` limit 1
select * from `currency_settings` limit 1

                                    <div class="movie-time d-flex align-items-center pt-1">
                                       <!-- Category Thumbnail  setting -->
                                      <?php
                                      $CategoryThumbnail_setting =  App\CategoryLive::join('live_categories','live_categories.id','=','livecategories.category_id')
                                                  ->where('livecategories.live_id',$category_video->id)
                                                  ->pluck('live_categories.name');
---
select `live_categories`.`name` from `livecategories` inner join `live_categories` on `live_categories`.`id` = `livecategories`.`category_id` where `livecategories`.`live_id` = 3