public/themes/default/views/partials/home/slider-1.php


<!-- Live Event Banners -->

<?php $live_event_banners = App\LiveEventArtist::where('active', 1)
    ->where('banner', 1)
    ->get(); ?>
---
select * from `live_event_artists` where `active` = 1 and `banner` = 1

if(Route::current()->getName() == "home" || Route::current()->getName() == null  ){


            $parentCategories = App\VideoCategory::where('in_home',1)->where('banner',1)->get();
---
select * from `video_categories` where `in_home` = 1 and `banner` = 1