public/themes/theme3/views/footer.blade.php

select * from `settings` limit 1
select * from `users` where `id` = 1 limit 1
select * from `pages` where `active` = 1
select `theme_mode` from `site_themes`
select * from `site_themes` limit 1
select * from `app_settings` where `id` = 1 limit 1
---

    $settings = App\Setting::first();
    $user     = App\User::where('id', '=', 1)->first();
    $session  = session()->all();
    $cmspages = App\Page::where('active', 1)->get();
    $theme_mode = App\SiteTheme::pluck('theme_mode')->first();
    $theme = App\SiteTheme::first();
    $app_settings = App\AppSetting::where('id', '=', 1)->first();

select * from `footer_links` where `column_position` = 1 order by `order` asc
---

                    $footerLinks = App\FooterLink::where('column_position', $i)
                        ->orderBy('order')
                        ->get();