public/themes/theme3/views/header.php

<head>
   <?php
   $Script = App\Script::pluck('header_script')->toArray();
   $theme_mode = App\SiteTheme::pluck('theme_mode')->first();
   $theme = App\SiteTheme::first();

   $signin_header = App\SiteTheme::pluck('signin_header')->first();
---
select `header_script` from `scripts`
select `theme_mode` from `site_themes`
select * from `site_themes` limit 1
select `signin_header` from `site_themes`

   if (!empty(Auth::User()->id)) {

      $id = Auth::User()->id;
      $users = App\User::find($id);
---
select * from `users` where `users`.`id` = 1 limit 1


   <?php

   $settings = App\Setting::first();

   $dynamic_page = App\Page::where('slug', '=', $request_url)->first();
---
select * from `settings` limit 1
select * from `pages` where `slug` = 'landing-page' limit 1

      $menus = App\Menu::orderBy('order', 'asc')->where('in_home', 1)->get();

   } elseif ($theme->header_position == 1) {
      $menus = App\Menu::orderBy('order', 'asc')->where('in_side_menu', 1)->get();
---
select * from `menus` where `in_side_menu` = 1 order by `order` asc

      <meta property="og:site_name" content="<?php echo $settings->website_name; ?>" />
   <?php } ?>

   <?php $Linking_Setting = App\LinkingSetting::first();
---
select * from `deep_linking_settings` limit 1


                                       <?php

                                          $header_top_position_menus = App\Menu::orderBy('order', 'asc')->where('in_home',1)->get();
---
select * from `menus` where `in_home` = 1 order by `order` asc


                                                   })->orwhere('parent_id',0)->orwhere('parent_id',null)->orderBy('order', 'asc')->where('in_menu',1)

                                                ->get()->map(function ($item) {

                                                $item['sub_video_category'] = App\VideoCategory::where('parent_id',$item->id)->orderBy('order', 'asc')->where('in_menu',1)->get();

                                                return $item;
                                          });
---
select * from `video_categories` where `parent_id` = 1 and `in_menu` = 1 order by `order` asc


                                                   })->orwhere('parent_id',0)->orwhere('parent_id',null)->orderBy('order', 'asc')

                                                ->get()->map(function ($item) {

                                                $item['sub_live_category'] = App\LiveCategory::where('parent_id',$item->id)->orderBy('order', 'asc')->get();

                                                return $item;
                                          });
---
select * from `live_categories` where `parent_id` = 1 order by `order` asc


                                                   })->orwhere('parent_id',0)->orwhere('parent_id',null)->orderBy('order', 'asc')->where('active',1)

                                                ->get()->map(function ($item) {

                                                $item['sub_audios_category'] = App\AudioCategory::where('parent_id',$item->id)->orderBy('order', 'asc')->get();

                                                return $item;
                                          });
---
select * from `audio_categories` where `parent_id` = 1 order by `order` asc


                                                   })->orwhere('parent_id',0)->orwhere('parent_id',null)->orderBy('order', 'asc')->where('in_menu',1)

                                                ->get()->map(function ($item) {

                                                $item['sub_series_category'] = App\SeriesGenre::where('parent_id',$item->id)->where('in_menu',1)->orderBy('order', 'asc')->get();

                                                return $item;
                                          });
---
select * from `series_genre` where `parent_id` = 1 and `in_menu` = 1 order by `order` asc


                                                   })->orwhere('parent_id',0)->orwhere('parent_id',null)->orderBy('order', 'asc')->where('in_menu',1)

                                                ->get()->map(function ($item) {

                                                $item['Sub_Series_Networks'] = App\SeriesNetwork::where('parent_id',$item->id)->where('in_menu',1)->orderBy('order', 'asc')->get();

                                                return $item;
                                          });

                                          $tv_shows_series = App\Series::where('active',1)->get();

                                          $languages = App\Language::all();
---
select * from `series_networks` where `parent_id` = 2 and `in_menu` = 1 order by `order` asc
select * from `series` where `active` = 1
select * from `languages`

                     <div class="d-flex p-2">
                        <?php if (!Auth::guest()) {
                           $userEmail = Auth::user()->email;
                           $moderatorsUser = App\ModeratorsUser::where('email', $userEmail)->first();
                           $channel = App\Channel::where('email', $userEmail)->first();
---
select * from `moderators_users` where `email` = 'admin@admin.com' limit 1
select * from `channels` where `email` = 'admin@admin.com' limit 1


   <?php

   $playerui_settings = App\Playerui::first();
---
select * from `playerui` limit 1