public/themes/theme1/views/partials/home/latest-series.php

select * from `order_homesettings` order by `order_id` asc
select * from `order_homesettings`
---
<?php  if(isset($latest_series)) :

  $order_settings = App\OrderHomeSetting::orderBy('order_id', 'asc')->get();
  $order_settings_list = App\OrderHomeSetting::get();

select count(*) as aggregate from `series_seasons` where `series_id` = 8
---
                <div class="seaplue mb-2" style="display:flex">

                  <div class="badge badge-secondary p-1 mr-2"><?php
                  $SeriesSeason = App\SeriesSeason::where('series_id',$latest_serie->id)->count();

select count(*) as aggregate from `episodes` where `series_id` = 8
---
                  ?></div>
                  <div class="badge badge-secondary p-1 mr-2">
                    <?php
                      $Episode = App\Episode::where('series_id',$latest_serie->id)->count();