public/themes/theme1/views/partials/home/slider-1.php

select * from `live_event_artists` where `active` = 1 and `banner` = 1
---
<!-- Video Sliders -->


                <!-- Live Event Banners -->
<?php $live_event_banners = App\LiveEventArtist::where('active',1)->where('banner',1)->get() ?>