public/themes/theme4/views/video-js-Player/video/videos-details-script-stripe.blade.php

        handler.open({
            name: '<?php $settings = App\Setting::first();
---
select * from `settings` limit 1