app/helper/helpers.php

select `artist_id` from `audio_artists` where `audio_id` = 9
select * from `artists` where `id` = 1 limit 1
---
function get_audio_artist($audio_id)
{
    $artist_ids = App\Audioartist::select('artist_id')->where('audio_id',$audio_id)->get();
    $artist_name = array();
    if(!empty($artist_ids)){
        foreach ($artist_ids as $key => $artist_id) {
            $artist_name[] = App\Artist::where('id',$artist_id->artist_id)->first()->artist_name;

select * from `settings` limit 1
---
function getFavicon(){

    $settings = App\Setting::first();

select * from `settings` limit 1
---
function VideoPerPage(){

    $settings = App\Setting::first();

select * from `settings` limit 1
---
function FacebookId(){

    $settings = App\Setting::first();

select * from `settings` limit 1
---
function TwiterId(){

    $settings = App\Setting::first();

select * from `settings` limit 1
---
function YoutubeId(){
    $settings = App\Setting::first();

select * from `settings` limit 1
---
function InstagramId(){
    $settings = App\Setting::first();

select * from `payment_settings` limit 1
---
function SubscriptionPlan() {
     $settings = App\PaymentSetting::first();

select * from `site_themes` limit 1
---
function GetDarkText(){
    $settings = App\SiteTheme::first();

select * from `site_themes` limit 1
---
function GetLightText(){
    $settings = App\SiteTheme::first();

select * from `site_themes` limit 1
---
function GetDarkLogourl()
{
     $settings = App\SiteTheme::first();

select * from `site_themes` limit 1
---
function GetDarkLogo()
{
     $settings = App\SiteTheme::first();

select * from `site_themes` limit 1
---
function front_end_logo()
{
    $theme = App\SiteTheme::first();

select * from `settings` limit 1
---
function GetCategoryVideoStatus()
{
     $settings = App\HomeSetting::first();

select * from `home_settings` limit 1
---
function GetLatestVideoStatus()
{
     $settings = App\HomeSetting::first();

select * from `home_settings` limit 1
---
function GetTrendingVideoStatus()
{
     $settings = App\HomeSetting::first();

select * from `videos`
---
function TotalViewcount(){
    $sum_view = App\Video::all()->sum('views');

select * from `visitors`
---
function TotalVisitorcount(){
    $sum_visitor= App\Visitor::all()->sum('id');

select count(*) as aggregate from `subscriptions` where date(`created_at`) >= '2024-04-23'
---
function TotalNewSubscribercount(){

    $newsubscribercount = App\Subscription::whereDate('created_at', '>=', \Carbon\Carbon::now()->today())->count();

select * from `settings` limit 1
---
function Getwebsitedescription(){
    $setting = App\Setting::first();

select * from `settings` limit 1
---
function send_password_notification($title,$message,$video_name='',$video_img='',$user_id){
    $fcm_postt ="https://fcm.googleapis.com/fcm/send";
    $settings = App\Setting::first();

select `button_bg_color` from `site_themes`
---
function button_bg_color()
{
    $button_color = App\SiteTheme::pluck('button_bg_color')->first();

select * from `geofencing` limit 1
---
function Geofencing(){
    $getfeching = App\Geofencing::first();

select * from `settings` order by `created_at` desc
---
function check_storage_exist(){

    $StorageSetting = App\StorageSetting::first();

select * from `site_themes` limit 1
---
function GetAdminLightBg()
{
     $settings = App\SiteTheme::first();