app/helper/helpers.php

select * from `videos`
---
function TotalViewcount(){
    $sum_view = App\Video::all()->sum('views');