app/helper/LogActivity.php

insert into `log_activity` (`subject`, `url`, `method`, `ip`, `agent`, `user_id`, `video_id`, `updated_at`, `created_at`) values ('Update Video.', 'https://localhost/recorderbillion/admin/videos/update', 'POST', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36', 1, 3, '2024-05-07 10:01:20', '2024-05-07 10:01:20')
---
	public static function addVideoUpdateLog($subject,$video_id)
    {
    	$log = [];
    	$log['subject'] = $subject;
    	$log['url'] = Request::fullUrl();
    	$log['method'] = Request::method();
    	$log['ip'] = Request::ip();
    	$log['agent'] = Request::header('user-agent');
    	$log['user_id'] = auth()->check() ? auth()->user()->id : 1;
		$log['video_id'] = $video_id;
    	LogActivityModel::create($log);

insert into `log_activity` (`subject`, `url`, `method`, `ip`, `agent`, `user_id`, `video_id`, `video_category_id`, `updated_at`, `created_at`) values ('Updated Category for Video.', 'https://localhost/recorderbillion/admin/videos/update', 'POST', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36', 1, 3, '1', '2024-05-07 10:01:20', '2024-05-07 10:01:20')
---
	public static function addVideoCategoryLog($subject,$video_id,$value)
    {
		// dd($video_id);
    	$log = [];
    	$log['subject'] = $subject;
    	$log['url'] = Request::fullUrl();
    	$log['method'] = Request::method();
    	$log['ip'] = Request::ip();
    	$log['agent'] = Request::header('user-agent');
    	$log['user_id'] = auth()->check() ? auth()->user()->id : 1;
		$log['video_id'] = $video_id;
		$log['video_category_id'] = $value;
    	LogActivityModel::create($log);

insert into `log_activity` (`subject`, `url`, `method`, `ip`, `agent`, `user_id`, `video_id`, `video_language_id`, `updated_at`, `created_at`) values ('Updated Language for Video.', 'https://localhost/recorderbillion/admin/videos/update', 'POST', '::1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/124.0.0.0 Safari/537.36', 1, 3, '1', '2024-05-07 10:01:20', '2024-05-07 10:01:20')
---
	public static function addVideoLanguageLog($subject,$video_id,$value)
    {
		// dd($video_id);
    	$log = [];
    	$log['subject'] = $subject;
    	$log['url'] = Request::fullUrl();
    	$log['method'] = Request::method();
    	$log['ip'] = Request::ip();
    	$log['agent'] = Request::header('user-agent');
    	$log['user_id'] = auth()->check() ? auth()->user()->id : 1;
		$log['video_id'] = $video_id;
		$log['video_language_id'] = $value;
    	LogActivityModel::create($log);