app/Http/Controllers/AdminDashboardController.php

select * from `users` where `id` = 1 limit 1
---
    public function Index()
    {
        if(!Auth::guest() && Auth::user()->package == 'Channel' ||  Auth::user()->package == 'CPP'){
                return redirect('/admin/restrict');
        }
           if (!Auth::user()->role == 'admin')
            {
                return redirect('/home');
            }
            $user =  User::where('id',1)->first();

select * from `storage_settings` limit 1
---
                return View::make('admin.expired_storage', $data);
            }else{

                $StorageSetting = StorageSetting::first();

select * from `video_categories`
select * from `categoryvideos`
select count(*) as aggregate from `categoryvideos` where `category_id` = 1
---
                    $space_disk = 0 .' '.'TB';
                }

        $videocategory = VideoCategory::get();
        $categoryvideo = CategoryVideo::get();
        if(count($videocategory) > 0){
        foreach($videocategory as $key => $category){
            // $video_category['name_category'] = $category->name;
            $video_category[$category->name] = CategoryVideo::where('category_id','=',$category->id)->count();

select * from `settings` limit 1
select count(*) as aggregate from `subscriptions` where `stripe_status` = 'active'
select count(*) as aggregate from `videos` where `active` = 1
select count(*) as aggregate from `ppv_videos` where `active` = 1
select count(*) as aggregate from `subscriptions` where date(`created_at`) > '2024-04-23'
select * from `videos` where `rating` > 7
select * from `recent_views` order by `id` desc limit 10
select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `role` = 'subscriber'
select sum(`total_amount`) as aggregate from `ppv_purchases` where month(`created_at`) = '04'
select sum(`price`) as aggregate from `subscriptions` where month(`created_at`) = '04'
---
        ->limit(10)->get();


         $settings = Setting::first();

         $total_subscription = Subscription::where('stripe_status','=','active')->count();

         $total_videos = Video::where('active','=',1)->count();

         $total_ppvvideos = PpvVideo::where('active','=',1)->count();

        $total_recent_subscription = Subscription::orderBy('created_at', 'DESC')->whereDate('created_at', '>', \Carbon\Carbon::now()->today())->count();
        $top_rated_videos = Video::orderBy('rating','DESC')->limit(10)->get();
        $recent_views = RecentView::limit(10)->orderBy('id','DESC')->get();
        $recent_view = $recent_views->unique('video_id');
        $page = 'admin-dashboard';

        $total_users = User::count();
        $Total_Subscribers = User::where('role','subscriber')->count();

        $Total_PPV_Revenue = PpvPurchase::sum('total_amount');
        $Total_Subscription_Revenue = Subscription::sum('price');

select * from `video_categories`
select * from `languages`
select count(*) as aggregate from `logged_devices`
select count(*) as aggregate from `guest_logged_devices`
---
        $Month_Subscription_Revenue = Subscription::whereMonth('created_at', Carbon::now()->month)->sum('price');
        $Total_Monthly_Revenue = $Month_PPV_Revenue + $Month_Subscription_Revenue;

        $VideoCategory = VideoCategory::get();
        $Language = Language::get();

        $LoggedDevice = LoggedDevice::count();