app/Http/Controllers/AdminThemeSettingsController.php

    public function theme_settings()
    {
        if ((!Auth::guest() && Auth::user()->package == 'Channel') || Auth::user()->package == 'CPP') {
            return redirect('/admin/restrict');
        }
        $user = User::where('id', 1)->first();
---
select * from `users` where `id` = 1 limit 1


            return View::make('admin.expired_storage', $data);
        } else {
            $settings = SiteTheme::first();
---
select * from `site_themes` limit 1

            $data = [
                'settings' => $settings,
                'admin_user' => $user,
                'AdminAccessPermission' => AdminAccessPermission::first(),
---
select * from `admin_access_permissions` limit 1