app/Http/Controllers/AdminVideosController.php

            $data["path"] = $path;
            $data["status"] = 0;
            $data["processed_low"] = 0;
            $video->update($data);
---
update `videos` set `today_top_video` = 0, `videos`.`updated_at` = '2024-05-07 10:01:19' where `id` != '3'