app/Http/Controllers/ChannelController.php

select * from `settings` limit 1
select `theme_choosen` from `home_settings`
---
    public function __construct()
    {
        $settings = Setting::first();
        $this->videos_per_page = $settings->videos_per_page;

        $this->Theme = HomeSetting::pluck('theme_choosen')->first();

select * from `videos` where `videos`.`id` = 5 limit 1
update `videos` set `views` = 452, `videos`.`updated_at` = '2024-04-23 13:17:34' where `id` = 5
---
    public function handleViewCount_movies($vid)
    {
        $movie = Video::find($vid);
        $movie->views = $movie->views + 1;
        $movie->save();