app/Http/Controllers/ChannelLoginController.php

select * from `settings` limit 1
select `theme_choosen` from `home_settings`
---
    public function __construct()
    {
        //$this->middleware('auth');
        $settings = Setting::first();
        $this->videos_per_page = $settings->videos_per_page;

        $this->Theme = HomeSetting::pluck('theme_choosen')
            ->first();

select * from `settings` limit 1
---
    public function index(Request $request)
    {
        $settings = Setting::first();