app/Http/Controllers/ChannelController.php

select * from `settings` limit 1
select * from `thumbnail_setting` limit 1
---
    public function LiveCategory(Request $request, $slug)
    {
        try {

            $LiveCategoryData = LiveCategory::where('slug', $slug)->first();

            $Live_Category = LiveCategory::find($LiveCategoryData->id)->specific_category_live ?? [];

            $category_title = LiveCategory::where('id', $LiveCategoryData->id)->pluck('name')->first();

            if(Geofencing() != null && Geofencing()->geofencing == 'ON') {

                $countryName = Country_name();

                $BlockLiveStream = BlockLiveStream::where('country', $countryName)->get();

                $blockLiveStreams = [];

                if(!$BlockLiveStream->isEmpty()) {
                    foreach($BlockLiveStream as $block_LiveStream) {
                        $blockLiveStreams[] = $block_LiveStream->live_id;
                    }
                    $Live_Category = $Live_Category->whereNotIn('id', $blockLiveStreams); // Remove get()
                }
            }

            $data = array(
                'Live_Category' => $Live_Category,
                'ThumbnailSetting' => ThumbnailSetting::first(),
                'category_title'   => $category_title,
            );