app/Http/Controllers/HomeController.php

select * from `home_settings` limit 1
---
                    ->count();
                $geoip = new \Victorybiz\GeoIPLocation\GeoIPLocation();

                $settings = Setting::first();

select * from `video_categories`
---
                }

                $genre = Genre::all();
                $genre_video_display = VideoCategory::all();

select * from `users` where `id` = 1 limit 1
---
                }
                else
                {
                    $Mode = User::where('id', Auth::user()->id)
                        ->first();