app/Http/Controllers/HomeController.php

    public function __construct()
    {
        $this->settings = Setting::first();
        $this->videos_per_page = $this->settings->videos_per_page;

        $this->HomeSetting = HomeSetting::first();
---
select * from `settings` limit 1
select * from `home_settings` limit 1

    public function FirstLanging(Request $request)
    {
        $data = Session::all();
        $settings = $this->settings ;
        $multiuser = Session::get('subuser_id');
        $getfeching = Geofencing::first();
        $Recomended = $this->HomeSetting;
        $ThumbnailSetting = ThumbnailSetting::first();
        $videos_expiry_date_status = videos_expiry_date_status();
        $default_vertical_image_url = default_vertical_image_url();
        $default_horizontal_image_url = default_horizontal_image_url();

                        // Order Setting
        $home_settings_on_value = collect($this->HomeSetting)->filter(function ($value) {
            return $value === '1' || $value === 1;
        })->keys()->toArray();

        $order_settings = OrderHomeSetting::select('video_name')->whereIn('video_name',$home_settings_on_value)->orderBy('order_id', 'asc')->paginate(2);
---
select * from `geofencing` limit 1
select * from `thumbnail_setting` limit 1
select `video_name` from `order_homesettings` where `video_name` in ('id', 'series', 'slider_choosen') order by `order_id` asc limit 2 offset 0
select count(*) as aggregate from `order_homesettings` where `video_name` in ('id', 'series', 'slider_choosen')

            $userIp = $geoip->getip();
            $countryName = $geoip->getCountry();

            $guest_devices_check = GuestLoggedDevice::where('user_ip', '=',$userIp)->where('device_name', '=', 'desktop')->first();
---
select * from `guest_logged_devices` where `user_ip` = '169.159.82.111' and `device_name` = 'desktop' limit 1

                    $adddevice->save();
                }

            $genre = Genre::all();
            $genre_video_display = VideoCategory::where('in_home',1)->orderBy('order','ASC')->limit(15)->get() ;

            $trending_videos = Video::select('id','title','slug','year','rating','access','publish_type','global_ppv','publish_time','publish_status','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','age_restrict','video_tv_image','player_image','details','description')
                                        ->where('active', '1')->where('status', '1')->where('draft', '1')
                                        ->where('views', '>', '5')->latest()
                                        ->limit(15)->get();
---
select * from `genres`
select * from `video_categories` where `in_home` = 1 order by `order` asc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `global_ppv`, `publish_time`, `publish_status`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `age_restrict`, `video_tv_image`, `player_image`, `details`, `description` from `videos` where `active` = '1' and `status` = '1' and `draft` = '1' and `views` > '5' order by `created_at` desc limit 15


            $latest_videos = $latest_videos->latest()->limit(15)->get();

            $trending_audios = Audio::select('id','title','slug','ppv_status','year','rating','access','ppv_price',
                'duration','rating','image','featured','player_image','details','description')
                ->where('active', '=', '1')->where('status', '=', '1')
                ->where('views', '>', '5')
                ->latest()->limit(15)
                ->get();

            $latest_audios = Audio::select('id','title','slug','ppv_status','year','rating','access','ppv_price',
                'duration','rating','image','featured','player_image','details','description')
                ->where('active', '1')->where('status', '1')
                ->latest()->limit(15)
                ->get();

            $trending_episodes = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                'duration','rating','image','featured','tv_image','player_image')
                ->where('active', '=', '1')->where('views', '>', '0')
                ->orderBy('id', 'DESC')
                ->limit(15)
                ->get();

            $latest_episode = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','tv_image','player_image')
                                        ->where('active', '1')->latest()->limit(15)
                                        ->get()->map(function($item){
                                            $item['series'] = Series::where('id',$item->series_id)->first();
                                            return $item ;
                                        });

            $latest_series = Series::select('id','title','slug','year','rating','access',
                'duration','rating','image','featured','tv_image','player_image','details','description')
                ->where('active', '1')->latest()->limit(15)
                ->get();
---
select `id`, `title`, `slug`, `ppv_status`, `year`, `rating`, `access`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `player_image`, `details`, `description` from `audio` where `active` = '1' and `status` = '1' and `views` > '5' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `ppv_status`, `year`, `rating`, `access`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `player_image`, `details`, `description` from `audio` where `active` = '1' and `status` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' and `views` > '0' order by `id` desc limit 15
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' order by `created_at` desc limit 15
select * from `series` where `id` = 7 limit 1
select `id`, `title`, `slug`, `year`, `rating`, `access`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image`, `details`, `description` from `series` where `active` = '1' order by `created_at` desc limit 15


            $featured_videos = $featured_videos->latest()->limit(15)->get();

            $featured_episodes = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                'duration','rating','image','featured','tv_image','player_image')
                ->where('active', '1')->where('featured', '1')
                ->latest()->limit(15)
                ->get();

            $pages = Page::all();
---
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' and `featured` = '1' order by `created_at` desc limit 15
select * from `pages`

            }


            $currency = CurrencySetting::first();
---
select * from `currency_settings` limit 1

                $livetreams =$livetreams->limit(15)->get();
            }

            $Series_based_on_Networks = SeriesNetwork::where('in_home', 1)->orderBy('order')->limit(15)->get()->map(function ($item) {

                $item['Series_depends_Networks'] = Series::where('series.active', 1)
                            ->whereJsonContains('network_id', [(string)$item->id])

                            ->latest('series.created_at')->limit(15)->get()->map(function ($item) {

                    $item['image_url']        = !is_null($item->image)  ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                    $item['Player_image_url'] = !is_null($item->player_image)  ? URL::to('public/uploads/images/'.$item->player_image ) : default_horizontal_image_url() ;

                    $item['upload_on'] =  Carbon\Carbon::parse($item->created_at)->isoFormat('MMMM Do YYYY');

                    $item['duration_format'] =  !is_null($item->duration) ?  Carbon\Carbon::parse( $item->duration)->format('G\H i\M'): null ;

                    $item['Series_depends_episodes'] = Series::find($item->id)->Series_depends_episodes
                                                            ->map(function ($item) {
                                                            $item['image_url']  = !is_null($item->image) ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                                                            return $item;
                                                        });

                    $item['source'] = 'Series';
---
select * from `series` where `series`.`active` = 1 and json_contains(`network_id`, '[\"2\"]') order by `series`.`created_at` desc limit 15
select * from `series_networks` where `in_home` = 1 order by `order` asc limit 15
select * from `series` where `series`.`id` = 1 limit 1

                return $item;
            });

            $Series_based_on_category = SeriesGenre::query()->whereHas('category_series', function ($query) {})
                    ->with([
                        'category_series' => function ($series) {
                            $series->select('series.*')->where('series.active', 1)->latest('series.created_at');
                        },
                    ])
                    ->select('series_genre.id', 'series_genre.name', 'series_genre.slug', 'series_genre.order')
                    ->orderBy('series_genre.order')
                    ->limit(15)
                    ->get();
---
select `series_genre`.`id`, `series_genre`.`name`, `series_genre`.`slug`, `series_genre`.`order` from `series_genre` where exists (select * from `series` inner join `series_categories` on `series`.`id` = `series_categories`.`series_id` where `series_genre`.`id` = `series_categories`.`category_id`) order by `series_genre`.`order` asc limit 15
select `series`.*, `series_categories`.`category_id` as `pivot_category_id`, `series_categories`.`series_id` as `pivot_series_id` from `series` inner join `series_categories` on `series`.`id` = `series_categories`.`series_id` where `series_categories`.`category_id` in (1, 2) and `series`.`active` = 1 order by `series`.`created_at` desc


                    $item['duration_format'] =  !is_null($item->duration) ?  Carbon\Carbon::parse( $item->duration)->format('G\H i\M'): null ;

                    $item['Series_depends_episodes'] = Series::find($item->id)->Series_depends_episodes
                                                            ->map(function ($item) {
                                                                $item['image_url']  = !is_null($item->image) ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                                                                return $item;
                                                        });
---
select * from `series` where `series`.`id` = 8 limit 1


                'currency' => $currency,
                'videos' => $latest_videos ,
                'video_banners' => Video::select('id','title','slug','year','rating','access','publish_type','global_ppv','publish_time','publish_status','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                    'duration','rating','image','featured','age_restrict','video_tv_image','player_image','details','description','trailer','trailer_type')->where('active', '=', '1')
                                    ->where('draft', '1')
                                    ->where('status', '1')
                                    ->where('banner', '1')
                                    ->orderBy('created_at', 'DESC')
                                    ->limit(15)
                                    ->get() ,

                'live_banner' => LiveStream::select('id','title','slug','year','rating','access','publish_type','publish_time','publish_status','ppv_price',
                                            'duration','rating','image','featured','Tv_live_image','player_image','details','description','free_duration')
                                            ->where('banner', '1')
                                            ->latest()->limit(15)->get() ,

                'sliders' => Slider::where('active',  '1')->orderBy('order_position', 'ASC')->limit(15)->get() ,

                'series_sliders' => Series::select('id','title','slug','year','rating','access',
                                'duration','rating','image','featured','tv_image','player_image','details','description')
                                ->where('active', '1')->where('banner','1')->latest()->limit(15)->get() ,
---
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `global_ppv`, `publish_time`, `publish_status`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `age_restrict`, `video_tv_image`, `player_image`, `details`, `description` from `videos` where `active` = '1' and `draft` = '1' and `status` = '1' and `banner` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `publish_time`, `publish_status`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `Tv_live_image`, `player_image`, `details`, `description`, `free_duration` from `live_streams` where `banner` = '1' order by `created_at` desc limit 15
select * from `sliders` where `active` = '1' order by `order_position` asc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image`, `details`, `description` from `series` where `active` = '1' and `banner` = '1' order by `created_at` desc limit 15

                'home_settings'       => $this->HomeSetting ,
                'livetream'           => $livetreams,
                'audios'              => $latest_audios ,
                'albums'              => AudioAlbums::orderBy('created_at', 'DESC')->get() ,
---
select * from `audio_albums` order by `created_at` desc

                'Family_Mode'           => $Family_Mode = 2,
                'Kids_Mode'             => $Kids_Mode = 2,
                'ThumbnailSetting'      => $ThumbnailSetting,
                'artist'                => Artist::all(),
                'Series_based_on_Networks' => $Series_based_on_Networks ,
                'Series_based_on_category' => $Series_based_on_category ,
                'VideoSchedules'        => VideoSchedules::where('in_home',1)->limit(15)->get(),
                'LiveCategory'         => LiveCategory::orderBy('order','ASC')->limit(15)->get(),
                'AudioCategory'         => AudioCategory::orderBy('order','ASC')->limit(15)->get(),
                'multiple_compress_image' => CompressImage::pluck('enable_multiple_compress_image')->first() ? CompressImage::pluck('enable_multiple_compress_image')->first() : 0,
                'SeriesGenre' =>  SeriesGenre::orderBy('order','ASC')->limit(15)->get(),
                'admin_advertistment_banners' => AdminAdvertistmentBanners::first(),
                'order_settings_list' => OrderHomeSetting::get(),
---
select * from `artists`
select * from `video_schedules` where `in_home` = 1 limit 15
select * from `live_categories` order by `order` asc limit 15
select * from `audio_categories` order by `order` asc limit 15
select `enable_multiple_compress_image` from `compress_images`
select * from `series_genre` order by `order` asc limit 15
select * from `admin_advertistment_banners` limit 1
select * from `order_homesettings`

                    $url1 = $_SERVER['REQUEST_URI'];
                    header("Refresh: 120; URL=$url1");
                    $message = 'Your Plan Device  Limit Is' . ' ' . $device_limit;
                    return view('device_logged', compact('alldevices', 'system_settings', 'user','userIp'))->with(array(
                        'message' => $message,
                        'note_type' => 'success'
                    ));
---
select * from `system_settings` limit 1

                    $settings = $this->settings ;
                    $PPV_settings = Setting::where('ppv_status', '=', 1)->first();

                    $latest_series = Series::select('id','title','slug','year','rating','access','duration','rating','image','featured','tv_image','player_image','details','description')
                        ->where('active', '1')->latest()->limit(15)->get();
---
select `id`, `title`, `slug`, `year`, `rating`, `access`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image`, `details`, `description` from `series` where `active` = '1' order by `created_at` desc

    public function index(Request $request)
    {

        $data = Session::all();
        $ThumbnailSetting = ThumbnailSetting::first();
        $default_vertical_image_url = default_vertical_image_url();
        $default_horizontal_image_url = default_horizontal_image_url();

        $agent = new Agent();
        $settings = $this->settings;
        $multiuser = Session::get('subuser_id');
        $getfeching = Geofencing::first();
---
select * from `thumbnail_setting` limit 1
select * from `geofencing` limit 1

            $regionName = $geoip->getregion();
            $cityName = $geoip->getcity();
            $data = Session::all();
            $system_settings = SystemSetting::first();
            $user = User::where('id', '=', 1)->first();
---
select * from `system_settings` limit 1
select * from `users` where `id` = 1 limit 1


                $user_role = Auth::user()->role;

                $user_check = LoggedDevice::where('user_id', '=', Auth::User()->id)->count();

                $subuser_check = Multiprofile::where('parent_id', '=', Auth::User()->id)->count();

                $alldevices_register = LoggedDevice::where('user_id', '=', Auth::User()->id)
                    ->where('device_name', '!=', $device_name)
                    ->where('user_ip', '!=', $userIp)
                    ->get();

                $alldevices = LoggedDevice::where('user_id', '=', Auth::User()->id)->get();

                $subscription_device_limit = Subscription::select('subscription_plans.devices')->join('subscription_plans', 'subscriptions.stripe_plan', '=', 'subscription_plans.plan_id')
                    ->where('subscriptions.user_id', Auth::User()->id)
                    ->get();
---
select count(*) as aggregate from `logged_devices` where `user_id` = 1
select count(*) as aggregate from `sub_users` where `parent_id` = 1
select * from `logged_devices` where `user_id` = 1 and `device_name` != 'desktop' and `user_ip` != '169.159.82.111'
select * from `logged_devices` where `user_id` = 1
select `subscription_plans`.`devices` from `subscriptions` inner join `subscription_plans` on `subscriptions`.`stripe_plan` = `subscription_plans`.`plan_id` where `subscriptions`.`user_id` = 1

                    $device_limit = 0;
                }

                $devices_check = LoggedDevice::where('user_id',Auth::User()->id)->where('device_name', $device_name)->first();

                $already_logged = LoggedDevice::where('user_id', '=', Auth::User()->id)
                ->where('user_ip',  $userIp)->where('device_name', $device_name)->count();

                if($already_logged > 0){
                    $already_logged = LoggedDevice::where('user_id', '=', Auth::User()->id)
                    ->where('user_ip', $userIp)
                    ->where('device_name', $device_name)->delete();
---
select * from `logged_devices` where `user_id` = 1 and `device_name` = 'desktop' limit 1
select count(*) as aggregate from `logged_devices` where `user_id` = 1 and `user_ip` = '169.159.82.111' and `device_name` = 'desktop'
delete from `logged_devices` where `user_id` = 1 and `user_ip` = '169.159.82.111' and `device_name` = 'desktop'


                $username = Auth::User()->username;
                $email = Auth::User()->email;
                $mail_check = ApprovalMailDevice::where('user_ip', '=', $userIp)->where('device_name', $device_name)->first();
                $user_check = LoggedDevice::where('user_id', '=', Auth::User()->id)->count();

                $subuser_check = Multiprofile::where('parent_id', '=', Auth::User()->id)->count();
---
select * from `approval_mail_devices` where `user_ip` = '169.159.82.111' and `device_name` = 'desktop' limit 1
select count(*) as aggregate from `logged_devices` where `user_id` = 1
select count(*) as aggregate from `sub_users` where `parent_id` = 1

                    if (!empty($device_name))
                    {

                        $devices_check = LoggedDevice::where('user_id', Auth::User()->id)->where('device_name', '=', $device_name)->first();
---
select * from `logged_devices` where `user_id` = 1 and `device_name` = 'desktop' limit 1

                    }
                }

                $logged = UserLogs::where('user_id', Auth::User()->id)->latest()
                    ->whereDate('created_at', '>=', \Carbon\Carbon::now()->today())->first();

                if (!empty($logged))
                {
                    $today_old_log = UserLogs::where('user_id', '=', Auth::User()->id)
                        ->latest()->whereDate('created_at', '>=', \Carbon\Carbon::now()->today())
                        ->delete();
---
select * from `ures_logs` where `user_id` = 1 and date(`created_at`) >= '2024-05-07' order by `created_at` desc limit 1
delete from `ures_logs` where `user_id` = 1 and date(`created_at`) >= '2024-05-07' order by `created_at` desc

                    $new_login->countryname = Country_name();
                    $new_login->regionname = Region_name();
                    $new_login->cityname = city_name();
                    $new_login->save();
---
insert into `ures_logs` (`user_id`, `user_ip`, `countryname`, `regionname`, `cityname`, `updated_at`, `created_at`) values (1, '169.159.82.111', 'Nigeria', 'Lagos', 'Lagos', '2024-05-07 10:02:10', '2024-05-07 10:02:10')

                    $new_login->save();
                }

                $users_logged_today = UserLogs::latest()->whereDate('created_at', '>=', \Carbon\Carbon::now()->today())->count();
---
select count(*) as aggregate from `ures_logs` where date(`created_at`) >= '2024-05-07'


                $settings = $this->settings;

                $PPV_settings = Setting::where('ppv_status', 1)->first();

                $ppv_gobal_price = !empty($PPV_settings) ? $PPV_settings->ppv_price : null;

                $genre = Genre::all();

                $genre_video_display = VideoCategory::where('in_home',1)->orderBy('order','ASC')->limit(15)->get();
---
select * from `settings` where `ppv_status` = 1 limit 1
select * from `genres`
select * from `video_categories` where `in_home` = 1 order by `order` asc limit 15

                }
                else
                {
                    $Mode = User::where('id', Auth::User()->id)->first();
---
select * from `users` where `id` = 1 limit 1

                }
                else
                {
                    $Mode = User::where('id', Auth::user()->id)->first();
                }

                $latest_series = Series::select('id','title','slug','year','rating','access','duration','rating','image','featured','tv_image','player_image','details','description')
                                        ->where('active', '1')->latest()->limit(15)
                                        ->get();

                $featured_episodes = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                            'duration','rating','image','featured','tv_image','player_image')
                                            ->where('active', '1')->where('featured' ,'1')
                                            ->latest()->limit(15)
                                            ->get();

                $trending_videos = Video::select('id','title','slug','year','rating','access','publish_type','global_ppv','publish_time','publish_status','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','age_restrict','video_tv_image','player_image','details','description')
                                        ->where('active', '1')->where('status', '1')->where('draft', '1')
                                        ->where('views', '>', '5')->latest()->limit(15)
                                        ->get();

                $trending_audios = Audio::select('id','title','slug','ppv_status','year','rating','access','ppv_price','duration','rating','image','featured','player_image','details','description')
                                        ->where('active', '1')->where('status', '1')
                                        ->where('views', '>', '5')
                                        ->latest()->limit(15)
                                        ->get();

                $latest_audios = Audio::select('id','title','slug','ppv_status','year','rating','access','ppv_price','duration','rating','image','featured','player_image','details','description')
                                        ->where('active', '1')->where('status', '1')
                                        ->latest()->limit(15)
                                        ->get();

                $trending_episodes = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','tv_image','player_image')
                                        ->where('active', '1')->where('views', '>', '0')
                                        ->latest()->limit(15)
                                        ->get();

                $latest_episode = Episode::select('id','title','slug','rating','access','series_id','season_id','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','tv_image','player_image')
                                        ->where('active', '1')->latest()->limit(15)
                                        ->get()->map(function($item){
                                            $item['series'] = Series::where('id',$item->series_id)->first();
                                            return $item ;
                                        });
---
select * from `users` where `id` = 1 limit 1
select `id`, `title`, `slug`, `year`, `rating`, `access`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image`, `details`, `description` from `series` where `active` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' and `featured` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `global_ppv`, `publish_time`, `publish_status`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `age_restrict`, `video_tv_image`, `player_image`, `details`, `description` from `videos` where `active` = '1' and `status` = '1' and `draft` = '1' and `views` > '5' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `ppv_status`, `year`, `rating`, `access`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `player_image`, `details`, `description` from `audio` where `active` = '1' and `status` = '1' and `views` > '5' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `ppv_status`, `year`, `rating`, `access`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `player_image`, `details`, `description` from `audio` where `active` = '1' and `status` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' and `views` > '0' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `rating`, `access`, `series_id`, `season_id`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image` from `episodes` where `active` = '1' order by `created_at` desc limit 15
select * from `series` where `id` = 7 limit 1


                }elseif (!Auth::guest()){

                    $continue_watching = ContinueWatching::where('user_id', Auth::user()->id)->first();

                    if ($continue_watching != null && $continue_watching->multiuser == null)
                    {
                        $getcnt_watching = ContinueWatching::where('user_id', Auth::user()->id)->pluck('videoid')->toArray();
---
select * from `continue_watchings` where `user_id` = 1 limit 1
select `videoid` from `continue_watchings` where `user_id` = 1

                    $cnt_watching = '';
                }

                $currency = CurrencySetting::first();
---
select * from `currency_settings` limit 1


                $livetreams =$livetreams->limit(15)->get();

                $Series_based_on_Networks = SeriesNetwork::where('in_home', 1)->orderBy('order')->limit(15)->get()->map(function ($item) {

                    $item['Series_depends_Networks'] = Series::where('series.active', 1)
                                ->whereJsonContains('network_id', [(string)$item->id])

                                ->latest('series.created_at')->limit(15)->get()->map(function ($item) {

                        $item['image_url']        = !is_null($item->image)  ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                        $item['Player_image_url'] = !is_null($item->player_image)  ? URL::to('public/uploads/images/'.$item->player_image ) : default_horizontal_image_url() ;

                        $item['upload_on'] = Carbon\Carbon::parse($item->created_at)->isoFormat('MMMM Do YYYY');

                        $item['duration_format'] =  !is_null($item->duration) ?  Carbon\Carbon::parse( $item->duration)->format('G\H i\M'): null ;

                        $item['Series_depends_episodes'] = Series::find($item->id)->Series_depends_episodes
                                                                ->map(function ($item) {
                                                                $item['image_url']  = !is_null($item->image) ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                                                                return $item;
                                                            });

                        $item['source'] = 'Series';
---
select * from `series` where `series`.`active` = 1 and json_contains(`network_id`, '[\"2\"]') order by `series`.`created_at` desc limit 15
select * from `series_networks` where `in_home` = 1 order by `order` asc limit 15
select * from `series` where `series`.`id` = 1 limit 1

                });


                $Series_based_on_category = SeriesGenre::query()->whereHas('category_series', function ($query) {})
                    ->with([
                        'category_series' => function ($series) {
                            $series->select('series.*')->where('series.active', 1)->latest('series.created_at');
                        },
                    ])
                    ->select('series_genre.id', 'series_genre.name', 'series_genre.slug', 'series_genre.order')
                    ->orderBy('series_genre.order')
                    ->limit(15)
                    ->get();
---
select `series_genre`.`id`, `series_genre`.`name`, `series_genre`.`slug`, `series_genre`.`order` from `series_genre` where exists (select * from `series` inner join `series_categories` on `series`.`id` = `series_categories`.`series_id` where `series_genre`.`id` = `series_categories`.`category_id`) order by `series_genre`.`order` asc limit 15
select `series`.*, `series_categories`.`category_id` as `pivot_category_id`, `series_categories`.`series_id` as `pivot_series_id` from `series` inner join `series_categories` on `series`.`id` = `series_categories`.`series_id` where `series_categories`.`category_id` in (1, 2) and `series`.`active` = 1 order by `series`.`created_at` desc


                        $item['duration_format'] =  !is_null($item->duration) ?  Carbon\Carbon::parse( $item->duration)->format('G\H i\M'): null ;

                        $item['Series_depends_episodes'] = Series::find($item->id)->Series_depends_episodes
                                                                ->map(function ($item) {
                                                                    $item['image_url']  = !is_null($item->image) ? URL::to('public/uploads/images/'.$item->image) : default_vertical_image() ;
                                                                    return $item;
                                                            });
---
select * from `series` where `series`.`id` = 8 limit 1

                    return $value === '1' || $value === 1;
                })->keys()->toArray();

                $order_settings = OrderHomeSetting::select('video_name')->whereIn('video_name',$home_settings_on_value)->orderBy('order_id', 'asc')->paginate(2);
---
select `video_name` from `order_homesettings` where `video_name` in ('id', 'series', 'slider_choosen') order by `order_id` asc limit 2 offset 0
select count(*) as aggregate from `order_homesettings` where `video_name` in ('id', 'series', 'slider_choosen')


                    'currency' => $currency,

                    'videos'  => Video::select('id','title','slug','year','rating','access','publish_type','global_ppv','publish_time','publish_status','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                    'duration','rating','image','featured','age_restrict','video_tv_image','player_image','details','description')
                                    ->where('active', '1')->where('status', '1')
                                    ->where('draft', '1')->latest()
                                    ->limit(15)->get() ,

                    'video_banners' => Video::select('id','title','slug','year','rating','access','publish_type','global_ppv','publish_time','publish_status','ppv_price','responsive_image','responsive_player_image','responsive_tv_image',
                                        'duration','rating','image','featured','age_restrict','video_tv_image','player_image','details','description','trailer','trailer_type')
                                        ->where('active', '1')
                                        ->where('draft', '1')->where('status', '1')->where('banner', '1')
                                        ->latest()->limit(15)->get() ,

                    'series_sliders' => Series::select('id','title','slug','year','rating','access',
                                        'duration','rating','image','featured','tv_image','player_image','details','description')
                                        ->where('active', '1')->where('banner','1')
                                        ->latest()->limit(15)->get() ,

                    'live_banner' => LiveStream::select('id','title','slug','year','rating','access','publish_type','publish_time','publish_status','ppv_price',
                                        'duration','rating','image','featured','Tv_live_image','player_image','details','description','free_duration')
                                        ->where('active', '1')
                                        ->where('banner', '1')
                                        ->latest()->limit(15)->get() ,

                    'current_page'      => 1,
                    'pagination_url'    => '/videos',
                    'sliders'           => Slider::where('active', '1') ->orderBy('order_position', 'ASC')->limit(15)->get() ,
---
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `global_ppv`, `publish_time`, `publish_status`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `age_restrict`, `video_tv_image`, `player_image`, `details`, `description` from `videos` where `active` = '1' and `status` = '1' and `draft` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `global_ppv`, `publish_time`, `publish_status`, `ppv_price`, `responsive_image`, `responsive_player_image`, `responsive_tv_image`, `duration`, `rating`, `image`, `featured`, `age_restrict`, `video_tv_image`, `player_image`, `details`, `description` from `videos` where `active` = '1' and `draft` = '1' and `status` = '1' and `banner` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `duration`, `rating`, `image`, `featured`, `tv_image`, `player_image`, `details`, `description` from `series` where `active` = '1' and `banner` = '1' order by `created_at` desc limit 15
select `id`, `title`, `slug`, `year`, `rating`, `access`, `publish_type`, `publish_time`, `publish_status`, `ppv_price`, `duration`, `rating`, `image`, `featured`, `Tv_live_image`, `player_image`, `details`, `description`, `free_duration` from `live_streams` where `active` = '1' and `banner` = '1' order by `created_at` desc limit 15
select * from `sliders` where `active` = '1' order by `order_position` asc limit 15

                    'genre_video_display' => $genre_video_display,
                    'genres'              => $genre_video_display ,
                    'settings'            => $settings,
                    'pages'               => Page::all(),
---
select * from `pages`

                    'home_settings'       => $this->HomeSetting ,
                    'livetream'           => $livetreams,
                    'audios'              => $latest_audios ,
                    'albums'              => AudioAlbums::latest()->limit(15) ->get() ,
---
select * from `audio_albums` order by `created_at` desc limit 15

                    'Mode'                 => $Mode,
                    'ThumbnailSetting'     => $ThumbnailSetting,
                    'latest_series'        => $latest_series,
                    'artist'               => Artist::limit(15)->get(),
                    'VideoSchedules'       => VideoSchedules::where('in_home',1)->limit(15)->get(),
                    'LiveCategory'         => LiveCategory::orderBy('order','ASC')->limit(15)->get(),
                    'AudioCategory'         => AudioCategory::orderBy('order','ASC')->limit(15)->get(),
                    'Series_based_on_Networks' => $Series_based_on_Networks ,
                    'Series_based_on_category' => $Series_based_on_category ,
                    'multiple_compress_image' => CompressImage::pluck('enable_multiple_compress_image')->first() ? CompressImage::pluck('enable_multiple_compress_image')->first() : 0,
                    'SeriesGenre' =>  SeriesGenre::orderBy('order','ASC')->limit(15)->get(),
                    'admin_advertistment_banners' => AdminAdvertistmentBanners::first(),
                    'order_settings_list' => OrderHomeSetting::get(),
---
select * from `artists` limit 15
select * from `video_schedules` where `in_home` = 1 limit 15
select * from `live_categories` order by `order` asc limit 15
select * from `audio_categories` order by `order` asc limit 15
select `enable_multiple_compress_image` from `compress_images`
select * from `series_genre` order by `order` asc limit 15
select * from `admin_advertistment_banners` limit 1
select * from `order_homesettings`
select * from `settings` limit 1