app/Http/Controllers/LandingpageController.php

    public function __construct()
    {
        $this->Theme = HomeSetting::pluck('theme_choosen')->first();
---
select `theme_choosen` from `home_settings`

   public function landing_page( $landing_page_slug )
   {
        $first_videos_categories_id = VideoCategory::orderBy('order')->pluck('id')->first();

        $data = [
            'title' => AdminLandingPage::where('status',1)->pluck('title')->first(),
            'sections_1' => AdminLandingPage::where('status',1)->where('section',1)->pluck('content'),
            'sections_2' => AdminLandingPage::where('status',1)->where('section',2)->pluck('content'),
            'sections_3' => AdminLandingPage::where('status',1)->where('section',3)->pluck('content'),
            'sections_4' => AdminLandingPage::where('status',1)->where('section',4)->pluck('content'),
            'custom_css' => AdminLandingPage::where('status',1)->orderBy('id','desc')->pluck('custom_css')->first(),
            'bootstrap_link'  => AdminLandingPage::where('status',1)->orderBy('id', 'desc')->pluck('bootstrap_link')->first(),
            'script_content'  => AdminLandingPage::where('status',1)->orderBy('id', 'desc')->pluck('script_content')->first(),
            'videos_categories' => VideoCategory::orderBy('order')->get(),
            'SeriesCategory'    => SeriesGenre::find($first_videos_categories_id) != null ? SeriesGenre::find($first_videos_categories_id)->specific_category_series : array(),
---
select `content` from `admin_landing_pages` where `status` = 1 and `section` = 1
select `content` from `admin_landing_pages` where `status` = 1 and `section` = 2
select `content` from `admin_landing_pages` where `status` = 1 and `section` = 3
select `content` from `admin_landing_pages` where `status` = 1 and `section` = 4
select `custom_css` from `admin_landing_pages` where `status` = 1 order by `id` desc
select `bootstrap_link` from `admin_landing_pages` where `status` = 1 order by `id` desc
select `script_content` from `admin_landing_pages` where `status` = 1 order by `id` desc
select * from `series_genre` where `series_genre`.`id` = 1 limit 1