app/Http/Controllers/LiveStreamController.php

  public function __construct()
  {

      $geoip = new \Victorybiz\GeoIPLocation\GeoIPLocation();
      $userIp = $geoip->getip();
      $countryName = $geoip->getCountry();
      $regionName = $geoip->getregion();
      $cityName = $geoip->getcity();

      $this->countryName = $countryName;

      $settings = Setting::first();
      $this->videos_per_page = $settings->videos_per_page;

      $this->Theme = HomeSetting::pluck('theme_choosen')
          ->first();
---
select * from `settings` limit 1
select `theme_choosen` from `home_settings`

    public function Index()
    {

      $settings = Setting::first();

      if($settings->enable_landing_page == 1 && Auth::guest()){

          $landing_page_slug = AdminLandingPage::where('status',1)->pluck('slug')->first() ? AdminLandingPage::where('status',1)->pluck('slug')->first() : "landing-page" ;

          return redirect()->route('landing_page', $landing_page_slug );
      }

        $Theme = HomeSetting::pluck('theme_choosen')->first();
        Theme::uses( $Theme );

        $live = LiveStream::where('active', '=', '1')->orderBy('id', 'DESC')->get();

        $vpp = VideoPerPage();
        $ThumbnailSetting = ThumbnailSetting::first();
---
select * from `settings` limit 1
select `theme_choosen` from `home_settings`
select * from `live_streams` where `active` = '1' order by `id` desc
select * from `thumbnail_setting` limit 1