app/Http/Controllers/Admin/HomeSettingsController.php

    public function index(){

        if(!Auth::guest() && Auth::user()->package == 'Channel' ||  Auth::user()->package == 'CPP'){
            return redirect('/admin/restrict');
    }
        $user =  User::where('id',1)->first();
---
select * from `users` where `id` = 1 limit 1

            return View::make('admin.expired_dashboard', $data);
        }else{

        $settings = HomeSetting::first();
        $order_settings = OrderHomeSetting::orderBy('order_id', 'asc')->get();
        $order_settings_list = OrderHomeSetting::get();
---
select * from `mobile_home_settings` limit 1
select * from `order_homesettings` order by `order_id` asc
select * from `order_homesettings`

    public function save_settings(Request $request){

        $settings = HomeSetting::first();
---
select * from `home_settings` limit 1